---
kind: property
id: P:Autodesk.Revit.DB.Form.PathCurveReference(System.Int32)
zh: 对话框、窗口、窗体
source: html/433dd986-562d-c969-98c6-7a84f7f8090e.htm
---
# Autodesk.Revit.DB.Form.PathCurveReference Property

**中文**: 对话框、窗口、窗体

The curve reference in the path, specified by curve index.

## Syntax (C#)
```csharp
public Reference this[
	int curveIndex
] { get; }
```

## Parameters
- **curveIndex** (`System.Int32`) - Index to specify the curve in path